app/controllers/entries_controller.rb

  def index
    @from = if params[:from]
      Date.strptime(params[:from], '%m/%d/%Y')
    else
      Date.new(Date.today.year, Date.today.month, 1)
    end

    @previous_month = (@from - 1.month).at_beginning_of_month
    @next_month = (@from + 1.month).at_beginning_of_month

    @entries = Entry.where(username: current_user.username).where('date >= ?', @from).order('date desc')
    @total = @entries.sum(:minutes)
---
SELECT "entries".* FROM "entries" WHERE "entries"."user" = 'papricek' AND (date >= '2013-11-01') ORDER BY date desc
SELECT SUM("entries"."minutes") AS sum_id FROM "entries" WHERE "entries"."user" = 'users' AND (date >= '2013-11-01')